In [2]:
#pandas .. 파이썬 데이터 처리 위해 존재하는 가장 인기있는 라이브러리
#dataFrame 로딩, 기본 API

In [3]:
import pandas as pd

In [7]:
from google.colab import files
uploaded = files.upload()
import io
titanic_df = pd.read_csv(io.BytesIO(uploaded['train.csv']))
#read_csv() 를 이용하여 csv파일을 편리하게 dataframe 으로 로딩할 수 있다.
# -> csv 파일만 로드 할 것 같지만 꼭 그런거 아님. 다른 파일 형식도 할 수 있다. c sv 에서 c는 comma 로, 띄어쓰기로 분류 되어있다는 뜻이고, tsb 로 되어있는건
# tab으로 구분하겠다는 뜻이당 그 땐 tab 으로 구분하게 인자 추가해주면 된다. 잘 모르겠으니 찾아보고 하자!

Saving train.csv to train (1).csv

In [11]:
titanic_df.head(5)
#index는 컬럼명이 비어있음. 젤 왼쪽에 0,1,2,3.. 붙는것!
#순수하게 유일한 값만을 나타냄

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [12]:
#dataframe의 생성

In [31]:
# dictionary 형태를 데이터 형으로.. 이 dic의 key 값이 바로 column 명!
dic1 = {'Name' : ['Byounghwa', 'Seohwi', 'Joonbaem', 'Hoonbalnom'],
        'Year' : ['21', '20', '19','5'],
        'Gender' : ['M','M', 'M','W']
        }
data_df = pd.DataFrame(dic1)

print(data_df)
#그냥 알아서 DataFrame으로 바꿔주고, 이를 통해 shape, index 같은 정보를 쉽게 얻어낼 수가 있노
print(data_df.index)
print('ㅗ'*30)

print(data_df.shape)
print('#'*30)

data_df = pd.DataFrame(dic1, columns = ['Names', 'Year', 'Gender' , 'Age'])
print(data_df)
print('#'*30)
data_df = pd.DataFrame(dic1, index = ['one', 'two', 'three', 'four'])
print(data_df)
#data_df = pd.DataFrame(dic1,  = ['11', '12', '13', '14']) NaN으로 되어있는 Age에 값을 채우려면 어떻게 해야하노? .. 모르겠다...
print('#'*30)
print(data_df)

         Name Year Gender
0   Byounghwa   21      M
1      Seohwi   20      M
2    Joonbaem   19      M
3  Hoonbalnom    5      W
RangeIndex(start=0, stop=4, step=1)
ㅗㅗㅗㅗㅗㅗㅗㅗㅗㅗㅗㅗㅗㅗㅗㅗㅗㅗㅗㅗㅗㅗㅗㅗㅗㅗㅗㅗㅗㅗ
(4, 3)
##############################
  Names Year Gender  Age
0   NaN   21      M  NaN
1   NaN   20      M  NaN
2   NaN   19      M  NaN
3   NaN    5      W  NaN
##############################
             Name Year Gender
one     Byounghwa   21      M
two        Seohwi   20      M
three    Joonbaem   19      M
four   Hoonbalnom    5      W
##############################
             Name Year Gender
one     Byounghwa   21      M
two        Seohwi   20      M
three    Joonbaem   19      M
four   Hoonbalnom    5      W

In [33]:
print("columns: ", titanic_df.columns)
print("index: ", titanic_df.index)
print("index value : " , titanic_df.index.values)

columns:  Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
index:  RangeIndex(start=0, stop=891, step=1)
index value :  [  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

In [34]:
#dataFrame에서 Series 추출, DataFrame 필터링 추출

In [40]:
series = titanic_df['Name']
print(series)

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [41]:
filtered_df = titanic_df[['Name', 'Age']]
print(filtered_df)
#DataFrame객체에서 []연산자내에 여러개의 컬럼을 리스트로 입력하면 그 컬럼들로 구성된 DataFrame 반환

                                                  Name   Age
0                              Braund, Mr. Owen Harris  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                             Allen, Mr. William Henry  35.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  27.0
887                       Graham, Miss. Margaret Edith  19.0
888           Johnston, Miss. Catherine Helen "Carrie"   NaN
889                              Behr, Mr. Karl Howell  26.0
890                                Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

In [44]:
#Shape - DataFrame의 행, 열 크기를 가지고 있다.
print(titanic_df.shape)
print(filtered_df.shape)
print(series.shape)

(891, 12)
(891, 2)
(891,)

In [50]:
#info - DataFrame 내 컬럼명, 데이터타입, Null 건수, 데이터 건수 정보 제공
print(titanic_df.info())
print('#'*40)
print('#'*40)

print(filtered_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None
########################################
########################################
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    891 non-null    object
 1   Age     714 non-null    float64
dtypes: float64(1), object(1)
memory usage: 14.0+ KB
None

In [51]:
#describe - 데이터값 평균 ,표준편차, 4분위 분포도 제공..

In [52]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [54]:
#value_counts - 특절 column의 데이터 값 분포를 확인하고 싶을때 주로 사용. 동일한 개별 데이터 값이 몇건이 있는지에 대한 정보 제공, 
#주의할 점은 value counts() 는 Series 객체에서만 호출 될 수 있기 때문에 반드시 DataFrame을 단일컬럼으로 입력하여 Series로 변환 후 호출해야 함.

In [56]:
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [57]:
series1 = titanic_df['Name']
value_count2 = series1.value_counts()
#이렇게 시리즈로 데이터프레임을 바꿔놓고 사용해야만 해요..

In [58]:
print(value_count2)

Braund, Mr. Owen Harris                     1
Boulos, Mr. Hanna                           1
Frolicher-Stehli, Mr. Maxmillian            1
Gilinski, Mr. Eliezer                       1
Murdlin, Mr. Joseph                         1
                                           ..
Kelly, Miss. Anna Katherine "Annie Kate"    1
McCoy, Mr. Bernard                          1
Johnson, Mr. William Cahoone Jr             1
Keane, Miss. Nora A                         1
Dooley, Mr. Patrick                         1
Name: Name, Length: 891, dtype: int64

In [59]:
#Sort_Values() - 정렬ㄹ컬럼. ascending = True, False 로 오름,내림 차순 순으로 정렬할 수 있어요

In [60]:
titanic_df.sort_values(by='Pclass', ascending=False)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
511,512,0,3,"Webber, Mr. James",male,NaN,0,0,SOTON/OQ 3101316,8.0500,NaN,S
500,501,0,3,"Calic, Mr. Petar",male,17.0,0,0,315086,8.6625,NaN,S
501,502,0,3,"Canavan, Miss. Mary",female,21.0,0,0,364846,7.7500,NaN,Q
502,503,0,3,"O'Sullivan, Miss. Bridget Mary",female,NaN,0,0,330909,7.6292,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
102,103,0,1,"White, Mr. Richard Frasar",male,21.0,0,1,35281,77.2875,D26,S
710,711,1,1,"Mayne, Mlle. Berthe Antonine (""Mrs de Villiers"")",female,24.0,0,0,PC 17482,49.5042,C90,C
711,712,0,1,"Klaber, Mr. Herman",male,NaN,0,0,113028,26.5500,C124,S
712,713,1,1,"Taylor, Mr. Elmer Zebley",male,48.0,1,0,19996,52.0000,C126,S
445,446,1,1,"Dodge, Master. Washington",male,4.0,0,2,33638,81.8583,A34,S

In [63]:
titanic_df[['Name', 'Age', 'Survived']].sort_values(by='Age', ascending=False)
#몇 항목만 빼서 정렬된 거 보고싶을 땐 이렇게..!

                                         Name   Age  Survived
630      Barkworth, Mr. Algernon Henry Wilson  80.0         1
851                       Svensson, Mr. Johan  74.0         0
493                   Artagaveytia, Mr. Ramon  71.0         0
96                  Goldschmidt, Mr. George B  71.0         0
116                      Connors, Mr. Patrick  70.5         0
..                                        ...   ...       ...
859                          Razi, Mr. Raihed   NaN         0
863         Sage, Miss. Dorothy Edith "Dolly"   NaN         0
868               van Melkebeke, Mr. Philemon   NaN         0
878                        Laleff, Mr. Kristo   NaN         0
888  Johnston, Miss. Catherine Helen "Carrie"   NaN         0

[891 rows x 3 columns]